Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: /(.)(.)(.)(.)(.)(.)(.)(.)(.)\10/ # \10 is octal
es: /(.)(.)(.)(.)(.)(.)(.)(.)(.)\10/ # \10 es octal

source: /(.)(.)(.)(.)(.)(.)(.)(.)(.)\g10/ # \g10 is a backreference
es: /(.)(.)(.)(.)(.)(.)(.)(.)(.)\g10/ # \g10 es una retrorreferencia

source: /(.)\g1/ # find first doubled char and print "'$1' is the first doubled character\n";
es: /(.)\g1/ # busca el primer carácter repetido and print "'$1' es el primer carácter repetido\n";

source: /(?'char'.)\g1/ # ... mix and match and print "'$1' is the first doubled character\n";
es: /(?'char'.)\g1/ # ... combinación de las anteriores and print "'$1' es el primer carácter repetido\n";

source: /(?:(?s-i)more.*than).*million/i
es: /(?:(?s-i)más.*que).*millones/i

source: /(?<NAME>(?&NAME_PAT))(?<ADDR>(?&ADDRESS_PAT))
es: /(?<NOMBRE>(?&NOMBRE_PAT))(?<DIR>(?&DIRECCIÓN_PAT))

source: /(?<char>.)\k<char>/ # ... a different way and print "'$+{char}' is the first doubled character\n";
es: /(?<car>.)\k<car>/ # ... de otra forma and print "'$+{car}' es el primer carácter repetido\n";

source: /(?s-i:more.*than).*million/i
es: /(?s-i:más.*que).*millones/i

source: /(\d\s){3}/ a three digits, each followed by a whitespace character (eg "3 4 5 ")
es: /(\d\s){3}/ tres dígitos, cada uno seguido de un espacio (p. ej. "3 4 5 ")

source: /(a.)+/ matches a string in which every odd-numbered letter is a (eg "abacadaf")
es: /(a.)+/ cadena en la que cada letra impar es "a" (p. ej., "abacadaf")

source: /^$/ nothing in the string (start and end are adjacent)
es: /^$/ cadena vacía (principio y final contiguos)

source: /^\d+/ string starts with one or more digits
es: /^\d+/ cadena que empieza por uno o varios dígitos

source: /the (\S+)(?{ $color = $^N }) (\S+)(?{ $animal = $^N })/i;
es: /el (\S+)(?{ $animal = $^N }) (\S+)(?{ $color = $^N })/i;

source: 0 dev 0 second 0 package $_ default variable
es: 0 dev 0 segundo 0 paquete $_ variable predeterminada

source: 0001-Rename-Leon-Brocard-to-Orange-Brocard.patch
es: 0001-Cambiar-nombre-de-Leon-Brocard-a-Orange-Brocard.patch

source: 0377 # octal (only numbers, begins with 0)
es: 0377 # octal (solo números, comienza con 0)

source: 0b011011 # binary
es: 0b011011 # binario

source: 0xdead_beef # more hex
es: 0xdead_beef # más hex

source: 1 ino 1 minute 1 filename $0 program name
es: 1 ino 1 minuto 1 nombre archivo $0 nombre programa

source: 1.001..10 1988-Jan-30 1.011..14 1988-Feb-02
es: 1.001..10 1988-Ene-30 1.011..14 1988-Feb-02

source: 10 ctime 10 hinthash @INC include paths
es: 10 ctime 10 hash de pistas @INC rutas de inclusión

source: 11 blksz 3..10 only @_ subroutine args
es: 11 blksz 3..10 solo @_ args subroutina

source: 12 blcks with EXPR %ENV environment
es: 12 blcks con EXPR %ENV entorno

source: 1; # don't forget to return a true value from the file
es: 1; # no olvide devolver un valor verdadero desde este archivo

source: 2 mode 2 hour 2 line $/ input separator
es: 2 mode 2 hora 2 línea $/ separador entrada

source: 2: got ABC
es: 2: se obtiene ABC

source: 3 nlink 3 day 3 subroutine $\ output separator
es: 3 nlink 3 día 3 subrutina $\ separador salida

source: 3.001 1989-Oct-26 3.002..4 1989-Nov-11 3.005 1989-Nov-18 3.006..8 1989-Dec-22 3.009..13 1990-Mar-02 3.014 1990-Mar-13 3.015 1990-Mar-14 3.016..18 1990-Mar-28 3.019..27 1990-Aug-10 User subs.
es: 3.001 1989-Oct-26 3.002..4 1989-Nov-11 3.005 1989-Nov-18 3.006..8 1989-Dic-22 3.009..13 1990-Mar-02 3.014 1990-Mar-13 3.015 1990-Mar-14 3.016..18 1990-Mar-28 3.019..27 1990-Ago-10 Subrutinas personalizadas

source: 3.028 1990-Aug-14 3.029..36 1990-Oct-17 3.037 1990-Oct-20 3.040 1990-Nov-10 3.041 1990-Nov-13 3.042..43 1991-Jan-??
es: 3.028 1990-Ago-14 3.029..36 1990-Oct-17 3.037 1990-Oct-20 3.040 1990-Nov-10 3.041 1990-Nov-13 3.042..43 1991-Ene-??

source: 3.044 1991-Jan-12
es: 3.044 1991-Ene-12

source: 3.14_15_92 # a very important number
es: 3.14_15_92 # un número muy importante

source: 3: got AB
es: 3: se obtiene AB

source: 3]; # array slice
es: 3]; # porción de array

source: 4 uid 4 month-1 4 hasargs $| autoflush
es: 4 uid 4 mes-1 4 hasargs $| volcado automático

source: 4-column indent.
es: Sangría de 4 columnas.

source: 4.001..3 1991-Apr-12 4.004..9 1991-Jun-07 4.010 1991-Jun-10 4.011..18 1991-Nov-05 4.019 1991-Nov-11 Stable.
es: 4.001..3 1991-Abr-12 4.004..9 1991-Jun-07 4.010 1991-Jun-10 4.011..18 1991-Nov-05 4.019 1991-Nov-11 Estable.

source: 4: got ABC
es: 4: se obtiene ABC

source: 4_294_967_296 # underscore for legibility
es: 4_294_967_296 # guión bajo para mejor legibilidad

source: 5 gid 5 year-1900 5 wantarray $!
es: 5 gid 5 año-1900 5 wantarray $!

source: 5.000alpha1 1993-Jul-31 5.000alpha2 1993-Aug-16 5.000alpha3 1993-Oct-10 5.000alpha4 1993-???-??
es: 5.000alpha1 1993-Jul-31 5.000alpha2 1993-Ago-16 5.000alpha3 1993-Oct-10 5.000alpha4 1993-???-??

source: 5.001f 1995-May-31 5.001g 1995-May-25 5.001h 1995-May-25 5.001i 1995-May-30 5.001j 1995-Jun-05 5.001k 1995-Jun-06 5.001l 1995-Jun-06 Stable.
es: 5.001f 1995-May-31 5.001g 1995-May-25 5.001h 1995-May-25 5.001i 1995-May-30 5.001j 1995-Jun-05 5.001k 1995-Jun-06 5.001l 1995-Jun-06 Estable.

source: 5.001m 1995-Jul-02 Very stable.
es: 5.001m 1995-Jul-02 Muy estable.

source: 5.001n 1995-Oct-31 Very unstable.
es: 5.001n 1995-Oct-31 Muy inestable.

source: 5.002beta1 1995-Nov-21 5.002b1a 1995-Dec-04 5.002b1b 1995-Dec-04 5.002b1c 1995-Dec-04 5.002b1d 1995-Dec-04 5.002b1e 1995-Dec-08 5.002b1f 1995-Dec-08
es: 5.002beta1 1995-Nov-21 5.002b1a 1995-Dic-04 5.002b1b 1995-Dic-04 5.002b1c 1995-Dic-04 5.002b1d 1995-Dic-04 5.002b1e 1995-Dic-08 5.002b1f 1995-Dic-08

source: 5.003 1996-Jun-25 Security release.
es: 5.003 1996-Jun-25 Versión de seguridad.

source: 5.003_91 1997-Mar-01 5.003_92 1997-Mar-06 5.003_93 1997-Mar-10 5.003_94 1997-Mar-22 5.003_95 1997-Mar-25 5.003_96 1997-Apr-01 5.003_97 1997-Apr-03 Fairly widely used.
es: 5.003_91 1997-Mar-01 5.003_92 1997-Mar-06 5.003_93 1997-Mar-10 5.003_94 1997-Mar-22 5.003_95 1997-Mar-25 5.003_96 1997-Abr-01 5.003_97 1997-Abr-03 Uso extendido.

source: 5.003_97a 1997-Apr-05 5.003_97b 1997-Apr-08 5.003_97c 1997-Apr-10 5.003_97d 1997-Apr-13 5.003_97e 1997-Apr-15 5.003_97f 1997-Apr-17 5.003_97g 1997-Apr-18 5.003_97h 1997-Apr-24 5.003_97i 1997-Apr-25 5.003_97j 1997-Apr-28 5.003_98 1997-Apr-30 5.003_99 1997-May-01 5.003_99a 1997-May-09 p54rc1 1997-May-12 Release Candidates.
es: 5.003_97a 1997-Abr-05 5.003_97b 1997-Abr-08 5.003_97c 1997-Abr-10 5.003_97d 1997-Abr-13 5.003_97e 1997-Abr-15 5.003_97f 1997-Abr-17 5.003_97g 1997-Abr-18 5.003_97h 1997-Abr-24 5.003_97i 1997-Abr-25 5.003_97j 1997-Abr-28 5.003_98 1997-Abr-30 5.003_99 1997-May-01 5.003_99a 1997-May-09 p54rc1 1997-May-12 Candidatas a versión final.

source: 5.004_01-t2 1997-Jun-11 aka perl5.004m1t2 5.004_01 1997-Jun-13 5.004_01_01 1997-Jul-29 aka perl5.004m2t1 5.004_01_02 1997-Aug-01 aka perl5.004m2t2 5.004_01_03 1997-Aug-05 aka perl5.004m2t3 5.004_02 1997-Aug-07 5.004_02_01 1997-Aug-12 aka perl5.004m3t1 5.004_03-t2 1997-Aug-13 aka perl5.004m3t2 5.004_03 1997-Sep-05 5.004_04-t1 1997-Sep-19 aka perl5.004m4t1 5.004_04-t2 1997-Sep-23 aka perl5.004m4t2 5.004_04-t3 1997-Oct-10 aka perl5.004m4t3 5.004_04-t4 1997-Oct-14 aka perl5.004m4t4 5.004_04 1997-Oct-15 5.004_04-m1 1998-Mar-04 (5.004m5t1) Maint.
es: 5.004_01-t2 1997-Jun-11 alias perl5.004m1t2 5.004_01 1997-Jun-13 5.004_01_01 1997-Jul-29 alias perl5.004m2t1 5.004_01_02 1997-Ago-01 alias perl5.004m2t2 5.004_01_03 1997-Ago-05 alias perl5.004m2t3 5.004_02 1997-Ago-07 5.004_02_01 1997-Ago-12 alias perl5.004m3t1 5.004_03-t2 1997-Ago-13 alias perl5.004m3t2 5.004_03 1997-Sep-05 5.004_04-t1 1997-Sep-19 alias perl5.004m4t1 5.004_04-t2 1997-Sep-23 alias perl5.004m4t2 5.004_04-t3 1997-Oct-10 alias perl5.004m4t3 5.004_04-t4 1997-Oct-14 alias perl5.004m4t4 5.004_04 1997-Oct-15 5.004_04-m1 1998-Mar-04 (5.004m5t1) Mantenimiento.

source: 5.004_04-m2 1998-May-01 5.004_04-m3 1998-May-15 5.004_04-m4 1998-May-19 5.004_05-MT5 1998-Jul-21 5.004_05-MT6 1998-Oct-09 5.004_05-MT7 1998-Nov-22 5.004_05-MT8 1998-Dec-03
es: 5.004_04-m2 1998-May-01 5.004_04-m3 1998-May-15 5.004_04-m4 1998-May-19 5.004_05-MT5 1998-Jul-21 5.004_05-MT6 1998-Oct-09 5.004_05-MT7 1998-Nov-22 5.004_05-MT8 1998-Dic-03

source: 5.004_51 1997-Oct-02 5.004_52 1997-Oct-15 5.004_53 1997-Oct-16 5.004_54 1997-Nov-14 5.004_55 1997-Nov-25 5.004_56 1997-Dec-18 5.004_57 1998-Feb-03 5.004_58 1998-Feb-06 5.004_59 1998-Feb-13 5.004_60 1998-Feb-20 5.004_61 1998-Feb-27 5.004_62 1998-Mar-06 5.004_63 1998-Mar-17 5.004_64 1998-Apr-03 5.004_65 1998-May-15 5.004_66 1998-May-29
es: 5.004_51 1997-Oct-02 5.004_52 1997-Oct-15 5.004_53 1997-Oct-16 5.004_54 1997-Nov-14 5.004_55 1997-Nov-25 5.004_56 1997-Dic-18 5.004_57 1998-Feb-03 5.004_58 1998-Feb-06 5.004_59 1998-Feb-13 5.004_60 1998-Feb-20 5.004_61 1998-Feb-27 5.004_62 1998-Mar-06 5.004_63 1998-Mar-17 5.004_64 1998-Abr-03 5.004_65 1998-May-15 5.004_66 1998-May-29

source: 5.005_02-T1 1998-Aug-02 5.005_02-T2 1998-Aug-05 5.005_02 1998-Aug-08
es: 5.005_02-T1 1998-Ago-02 5.005_02-T2 1998-Ago-05 5.005_02 1998-Ago-08

source: 5.005_51 1998-Aug-10 5.005_52 1998-Sep-25 5.005_53 1998-Oct-31 5.005_54 1998-Nov-30 5.005_55 1999-Feb-16 5.005_56 1999-Mar-01 5.005_57 1999-May-25 5.005_58 1999-Jul-27 5.005_59 1999-Aug-02 5.005_60 1999-Aug-02 5.005_61 1999-Aug-20 5.005_62 1999-Oct-15 5.005_63 1999-Dec-09 5.5.640 2000-Feb-02 5.5.650 2000-Feb-08 beta1 5.5.660 2000-Feb-22 beta2 5.5.670 2000-Feb-29 beta3 5.6.0-RC1 2000-Mar-09 Release candidate 1.
es: 5.005_51 1998-Ago-10 5.005_52 1998-Sep-25 5.005_53 1998-Oct-31 5.005_54 1998-Nov-30 5.005_55 1999-Feb-16 5.005_56 1999-Mar-01 5.005_57 1999-May-25 5.005_58 1999-Jul-27 5.005_59 1999-Ago-02 5.005_60 1999-Ago-02 5.005_61 1999-Ago-20 5.005_62 1999-Oct-15 5.005_63 1999-Dic-09 5.5.640 2000-Feb-02 5.5.650 2000-Feb-08 beta1 5.5.660 2000-Feb-22 beta2 5.5.670 2000-Feb-29 beta3 5.6.0-RC1 2000-Mar-09 Primera candidata a versión definitiva.

source: 5.10.0 2007-Dec-18 50 31 13111 From 5.9.5
es: 5.10.0 2007-Dec-18 50 31 13111 Desde 5.9.5

source: 5.6.0-RC2 2000-Mar-14 Release candidate 2.
es: 5.6.0-RC2 2000-Mar-14 Segunda candidata a versión definitiva.

source: 5.6.0-RC3 2000-Mar-21 Release candidate 3.
es: 5.6.0-RC3 2000-Mar-21 Tercera candidata a versión definitiva.

source: 5.6.1 2001-Apr-08
es: 5.6.1 2001-Abr-08

source: 5.6.1-TRIAL2 2001-Jan-31 5.6.1-TRIAL3 2001-Mar-19 5.6.1-foolish 2001-Apr-01 The "fools-gold" release.
es: 5.6.1-TRIAL2 2001-Ene-31 5.6.1-TRIAL3 2001-Mar-19 5.6.1-foolish 2001-Abr-01 La versión "fools-gold".

source: 5.7.1 2001-Apr-09 5.7.2 2001-Jul-13 Virtual release candidate 0.
es: 5.7.1 2001-Apr-09 5.7.2 2001-Jul-13 Candidata a versión definitiva virtual 0.

source: 6 rdev 6 weekday 6 evaltext $@ eval error
es: 6 rdev 6 día semana 6 evaltext $@ error eval

source: 6: got ABC
es: 6: se obtiene ABC

source: 7 size 7 yearday 7 is_require $$ process ID
es: 7 size 7 día año 7 is_require $$ Id. proceso

source: 9 mtime 9 bitmask @ARGV command line args
es: 9 mtime 9 máscara bits @ARGV args línea comandos

source: :-) Larry now uses "Perl" to signify the language proper and "perl" the implementation of it, i.e. the current interpreter.
es: :-) Larry usa "Perl" para designar el lenguaje y "perl" para designar su implementación (es decir, el intérprete).

source: < less than
es: < menor que

source: <= less than or equal
es: <= menor o igual que

source: = assignment
es: = asignación

source: = += -= *= etc ? zero or one /p preserve
es: = += -= *= etc ? cero o una /p preservar

source: == equality
es: == igual que

source: =for comment Consistent formatting of this file is achieved with:
es: =for comment Para aplicar un formato uniforme a este archivo, use:

source: =for disclaimer orking cows is hazardous, and not legal in all jurisdictions
es: =for Aviso: saberlo todo es peligroso y puede ser ilegal en algunas jurisdicciones

source: =head1 A basic example
es: =head1 Ejemplo básico

source: =head1 ACKNOWLEDGEMENTS
es: =head1 AGRADECIMIENTOS

source: =head1 AUTHOR
es: =head1 AUTOR

source: =head1 AUTHOR AND COPYRIGHT
es: =head1 AUTOR Y COPYRIGHT

source: =head1 AUTHORS
es: =head1 AUTORES

source: =head1 AVAILABILITY
es: =head1 DISPONIBILIDAD

source: =head1 Accepting a patch
es: =head1 Aceptar un parche

source: =head1 BUGS
es: =head1 ERRORES

source: =head1 CHANGES
es: =head1 CAMBIOS

source: =head1 CLONING THE REPOSITORY
es: =head1 CLONAR EL REPOSITORIO

source: =head1 CONCLUSION
es: =head1 CONCLUSIÓN

source: =head1 Caching
es: =head1 Almacenamiento en caché

source: =head1 Callbacks
es: =head1 Retrollamadas

source: =head1 DATE
es: =head1 FECHA

source: =head1 DESCRIPTION
es: =head1 DESCRIPCIÓN

source: =head1 DIAGNOSTICS
es: =head1 DIAGNÓSTICO

source: =head1 ENVIRONMENT
es: =head1 ENTORNO

source: =head1 EXAMPLE OF A SIMPLE PATCH
es: =head1 EJEMPLO DE PARCHE SENCILLO

source: =head1 Examples
es: =head1 Ejemplos

source: =head1 FILES
es: =head1 ARCHIVOS

source: =head1 FINDING YOUR WAY AROUND
es: =head1 ORIENTACIÓN

source: =head1 Flavors of Perl numeric operations
es: =head1 Tipos de operaciones numéricas en Perl

source: =head1 GETTING HELP
es: =head1 CÓMO OBTENER AYUDA

source: =head1 HEY
es: =head1 UNA COSA MÁS

source: =head1 INTERNALS
es: =head1 COMPONENTES INTERNOS

source: =head1 INTRODUCTION
es: =head1 INTRODUCCIÓN

source: =head1 Implementation details
es: =head1 Detalles de la implementación

source: =head1 Key naming
es: =head1 Nomenclatura de claves

source: =head1 LICENSE
es: =head1 LICENCIA

source: =head1 LIST OF UTILITIES
es: =head1 LISTA DE UTILIDADES

source: =head1 NAME
es: =head1 NOMBRE

source: =head1 NAME X<object> X<OOP>
es: =head1 NOMBRE X<object> X<objeto> X<OOP> X<POO>

source: =head1 NAME X<regular expression> X<regex> X<regexp>
es: =head1 NOMBRE X<regular expression> X<expresión regular> X<regex> X<regexp>

source: =head1 NOTES
es: =head1 NOTAS

source: =head1 Numeric operators and numeric conversions
es: =head1 Operadores numéricos y conversiones numéricas

source: =head1 OBJECT-ORIENTED FUNDAMENTALS
es: =head1 FUNDAMENTOS DE LA ORIENTACIÓN A OBJETOS

source: =head1 OPTIONS
es: =head1 OPCIONES

source: =head1 PERL OO SYSTEMS
es: =head1 SISTEMAS ORIENTADOS A OBJETOS EN PERL

source: =head1 PORTABILITY
es: =head1 PORTABILIDAD

source: =head1 Q and A
es: =head1 Preguntas y respuestas

source: =head1 Q and A (or FAQ)
es: =head1 Preguntas y respuestas (o P+F)

source: =head1 SECURITY
es: =head1 SEGURIDAD

source: =head1 SEE ALSO
es: =head1 VEA TAMBIÉN

source: =head1 SUMMARY
es: =head1 RESUMEN

source: =head1 SYNOPSIS
es: =head1 SINOPSIS

source: =head1 Storing numbers
es: =head1 Cómo se almacenan los números

source: =head1 THE KEEPERS OF THE PUMPKIN
es: =head1 LOS TITULARES DE LA CALABAZA

source: =head1 THE KEEPERS OF THE RECORDS
es: =head1 LOS CONSERVADORES DE LOS REGISTROS

source: =head1 THE RECORDS
es: =head1 LOS REGISTROS

source: =head1 Topic branches and rewriting history
es: =head1 Ramas puntuales e historial de reescritura

source: =head1 WORKING WITH THE REPOSITORY
es: =head1 TRABAJAR CON EL REPOSITORIO

source: =head1 WRITE ACCESS TO THE GIT REPOSITORY
es: =head1 ACCESO DE ESCRITURA AL REPOSITORIO DE GIT

source: =head2 $^X doesn't always contain a full path in FreeBSD
es: =head2 En FreeBSD, $^X no siempre contiene una ruta de acceso completa

source: =head2 A Class is Simply a Package X<class> X<package> X<@ISA> X<inheritance>
es: =head2 Una clase no es más que un paquete X<class> X<clase> X<package> X<paquete> X<@ISA> X<inheritance> X<herencia>

source: =head2 A Method is Simply a Subroutine X<method>
es: =head2 Un método no es más que una subrutina X<method> X<método>

source: =head2 A note on camel and dromedary
es: =head2 Nota sobre los servidores I<camel> (camello) y I<dromedary> (dromedario)

source: =head2 A note on derived files
es: =head2 Nota sobre archivos derivados

source: =head2 A note on freshness
es: =head2 ¿Está la lista al día?

source: =head2 Accepted features
es: =head2 Funcionalidades aprobadas

source: =head2 Administration
es: =head2 Administración

source: =head2 An Aside About Smarter and Safer Code
es: =head2 Un inciso sobre cómo crear código más sólido y seguro

source: =head2 An Example: the NULL termination problem.
es: =head2 Ejemplo: el problema de la terminación de cadenas con un carácter NULL

source: =head2 An Object is Simply a Data Structure X<object> X<bless> X<constructor> X<new>
es: =head2 Un objeto es simplemente una estructura de datos X<object> X<bless> X<constructor> X<new> X<objeto> X<bendecir>

source: =head2 Another Example: Key is a C int.
es: =head2 Otro ejemplo: las claves son enteros de C

source: =head2 Attributes
es: =head2 Atributos

source: =head2 Attributes X<attribute>
es: =head2 Atributos X<attribute> X<atributo>

source: =head2 BEGIN, UNITCHECK, CHECK, INIT and END X<BEGIN> X<UNITCHECK> X<CHECK> X<INIT> X<END>
es: =head2 BEGIN, UNITCHECK, CHECK, INIT y END X<BEGIN> X<UNITCHECK> X<CHECK> X<INIT> X<END>

source: =head2 Backtracking X<backtrack> X<backtracking>
es: =head2 Vuelta atrás X<backtrack> X<backtracking> X<volver atrás> X<vuelta atrás>

source: =head2 Basic syntax overview
es: =head2 Descripción general de la sintaxis básica

source: =head2 Bisecting
es: =head2 Bisecar

source: =head2 Build system
es: =head2 Sistema de compilación

source: =head2 Builtin operators and functions
es: =head2 Funciones y operadores predefinidos

source: =head2 C code
es: =head2 Código C

source: =head2 C<bless>, C<blessed>, and C<ref>
es: =head2 C<bless>, C<blessed> y C<ref>

source: =head2 Calendar of Perl Events
es: =head2 Calendario de eventos Perl

source: =head2 Can I do [task] in Perl?
es: =head2 ¿Puedo hacer [tarea] en Perl?

source: =head2 Can I use Unicode in my Perl sources?
es: =head2 ¿Puedo usar Unicode en mi código fuente Perl?

source: =head2 Character Class Tests
es: =head2 Pruebas de clases de caracteres

source: =head2 Class
es: =head2 Clase

source: =head2 Cleaning a working directory
es: =head2 Limpiar un directorio de trabajo

source: =head2 Combining RE Pieces
es: =head2 Combinación de partes de expresiones regulares

source: =head2 Committing to blead
es: =head2 Confirmar en blead

source: =head2 Committing to maintenance versions
es: =head2 Confirmar en versiones de mantenimiento

source: =head2 Committing your changes
es: =head2 Confirmar los cambios

source: =head2 Composition
es: =head2 Composición

source: =head2 Conditional and looping constructs
es: =head2 Estructuras condicionales y de bucle

source: =head2 Context X<context> X<scalar context> X<list context>
es: =head2 Contexto X<context> X<scalar context> X<list context> X<contexto> X<contexto de escalar> X<contexto de lista>

source: =head2 Conventions
es: =head2 Congresos

source: =head2 Converters
es: =head2 Conversores

source: =head2 Core modules
es: =head2 Módulos integrados en el núcleo

source: =head2 Creating Custom RE Engines
es: =head2 Crear motores de expresiones regulares personalizados

source: =head2 Current experiments
es: =head2 Experimentos actuales

source: =head2 Data::Dumper doesn't restore the UTF8 flag; is it broken?
es: =head2 Data::Dumper no restaura la marca UTF8. ¿Es esto un error?

source: =head2 Definitions
es: =head2 Definiciones

source: =head2 Destructors X<destructor> X<DESTROY>
es: =head2 Destructores X<destructor> X<DESTROY>

source: =head2 Development
es: =head2 Desarrollo

source: =head2 Documentation
es: =head2 Documentación

source: =head2 Documenting the patch
es: =head2 Documentar el parche

source: =head2 Encapsulation
es: =head2 Encapsulación

source: =head2 Extended Patterns
es: =head2 Patrones extendidos

source: =head2 F<stdlib.h> functions
es: =head2 Funciones de F<stdlib.h>

source: =head2 File Input and Output
es: =head2 Entrada/salida de archivo

source: =head2 File Operations
es: =head2 Operaciones con archivos

source: =head2 File Positioning
es: =head2 Posición en archivo

source: =head2 Files and I/O
es: =head2 Archivos y E/S

source: =head2 Finding out your status
es: =head2 Determinar el estado actual

source: =head2 Free (as in beer) books
es: =head2 Libros gratuitos

source: =head2 FreeBSD core dumps from readdir_r with ithreads
es: =head2 FreeBSD vuelca la memoria de trabajo desde readdir_r con ithreads

source: =head2 General tools
es: =head2 Herramientas de propósito general

source: =head2 Get your book listed
es: =head2 Cómo incluir su libro en la lista

source: =head2 Grafts
es: =head2 Injertos

source: =head2 Hacking tools and documentation
es: =head2 Herramientas y documentación para «hackear»

source: =head2 How can I convince others to use Perl?
es: =head2 ¿Cómo puedo animar a otros programadores a probar Perl?

source: =head2 How can I determine if a string is a text string or a binary string?
es: =head2 ¿Cómo se puede determinar si una cadena es una cadena de texto o una cadena binaria?

source: =head2 How can I get a binary version of Perl?
es: =head2 ¿Cómo puedo obtener una versión binaria de perl?

source: =head2 How do I convert from encoding FOO to encoding BAR?
es: =head2 ¿Cómo puedo pasar de la codificación A a la codificación B?

source: =head2 How does Perl compare with other languages like Java, Python, REXX, Scheme, or Tcl?
es: =head2 ¿Cómo es Perl en comparación con otros lenguajes como Java, Python, REXX, Scheme o Tcl?

source: =head2 How stable is Perl?
es: =head2 ¿Es Perl estable?

source: =head2 I copied the Perl binary from one machine to another, but scripts don't work.
es: =head2 He copiado el binario perl de una máquina a otra, pero los scripts no funcionan.

source: =head2 I don't have a C compiler.
es: =head2 No dispongo de un compilador de C.

source: =head2 I grabbed the sources and tried to compile but gdbm/dynamic loading/malloc/linking/... failed.
es: =head2 He descargado el código fuente y he intentado compilarlo, pero se produjo un error en el proceso de gdbm/carga dinámica/asignación de memoria/vinculación/...

source: =head2 I lost track; what encoding is the internal format really?
es: =head2 Me he perdido. ¿Qué codificación se usa realmente para el formato interno?

source: =head2 I/O flow (the actual 5 minute tutorial)
es: =head2 Flujo de E/S (el auténtico tutorial, en 5 minutos)

source: =head2 Inheritance
es: =head2 Herencia

source: =head2 Inheritance X<inheritance>
es: =head2 Herencia X<inheritance> X<herencia>

source: =head2 Inside-Out objects
es: =head2 Objetos I<Inside-Out>

source: =head2 Installation
es: =head2 Instalación

source: =head2 Internals and C Language Interface
es: =head2 Componentes e interfaz con el lenguaje C

source: =head2 Invoking Class Methods X<invocation>
es: =head2 Invocación de métodos de clase X<invocation> X<invocación>

source: =head2 Is Perl difficult to learn?
es: =head2 ¿Es difícil aprender a programar en Perl?

source: =head2 Is it a Perl program or a Perl script?
es: =head2 ¿Se debe decir programa Perl o script Perl?

source: =head2 Is there a way to automatically decode or encode?
es: =head2 ¿Existe alguna manera de descodificar o codificar automáticamente?

source: =head2 Known Problems with Perl on Hurd
es: =head2 Problemas conocidos de Perl en Hurd

source: =head2 Language-Specific
es: =head2 Idiomas específicos

source: =head2 List value constructors X<list>
es: =head2 Constructores de listas X<list> X<lista>

source: =head2 Mailing Lists and Newsgroups
es: =head2 Listas de correo y grupos de noticias

source: =head2 Making your module threadsafe X<threadsafe> X<thread safe> X<module, threadsafe> X<module, thread safe> X<CLONE> X<CLONE_SKIP> X<thread> X<threads> X<ithread>
es: =head2 Crear módulos seguros para hilos de ejecución X<threadsafe> X<thread safe> X<seguro para hilos de ejecución> X<module, threadsafe> X<module, thread safe> X<seguro para hilos de ejecución> X<CLONE> X<CLONE_SKIP> X<thread> X<hilo de ejecución> X<threads> X<hilos de ejecución> X<ithread> X<hilo de ejecución de intérprete>
